In [1]:
import pandas as pd
import numpy as np

In [37]:
dict= {"City": ['Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'NY'], "Area":["Sarojini","Kolaba","Rajpath","Gateway","NYC"], "Population": [25000,20000,55000,15000,5000], "Price":[10,12,8,5,65]}

In [38]:
df= pd.DataFrame(dict)

In [39]:
df

     City      Area  Population  Price
0   Delhi  Sarojini       25000     10
1  Mumbai    Kolaba       20000     12
2   Delhi   Rajpath       55000      8
3  Mumbai   Gateway       15000      5
4      NY       NYC        5000     65

In [40]:
# Filter only rows whose city has mean population > 30000
filtered_df= df.groupby("City").filter(lambda x: x['Population'].mean()>15000)

In [41]:
filtered_df

     City      Area  Population  Price
0   Delhi  Sarojini       25000     10
1  Mumbai    Kolaba       20000     12
2   Delhi   Rajpath       55000      8
3  Mumbai   Gateway       15000      5

In [45]:
def function_new(row):
    row['the_weird_column']= row['Population']+row['Price']
    return row
new_df= filtered_df.apply(function_new, axis=1)

In [46]:
new_df

     City      Area  Population  Price  the_weird_column
0   Delhi  Sarojini       25000     10             25010
1  Mumbai    Kolaba       20000     12             20012
2   Delhi   Rajpath       55000      8             55008
3  Mumbai   Gateway       15000      5             15005